Revit 2025 API
BendingDetailDisplayParametersOptions Enumeration
 Describes how the parameters will be represented.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum BendingDetailDisplayParametersOptions
Public Enumeration BendingDetailDisplayParametersOptions
public enum class BendingDetailDisplayParametersOptions
type BendingDetailDisplayParametersOptions
Members
Member name | Value | Description
ByValue | 0 |  Dimensions that are shown will be labeled using the parameters values.
ByName | 1 |  Dimensions that are shown will be labeled using the parameters names.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace